# Deps for install
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-versions" # Alternate versions of Casks for the Homebrew Cask project.
brew "mas"

# General dev
brew "cmake"
brew "libpng"
brew "ragel"
brew "git"
brew "asdf"
  # Deps for asdf nodejs
  # Read more to setup: https://github.com/asdf-vm/asdf-nodejs
  brew "coreutils"
  brew "gpg"

# Cli thing
brew "jq"
brew "tldr"
brew 'bash'
brew 'bash-completion'
brew "httpie"
brew "fd"
brew "fzf"

# Directory to install
cask_args appdir: "/Applications"
# Cask / GUI
#cask "font-source-code-pro-for-powerline"
cask "docker"
cask "google-cloud-sdk"
cask "spectacle"
cask "iterm2"
cask "visual-studio-code"
cask "brave-browser"
cask "iina" # The modern media player for macOS
cask "itsycal" # Itsycal is a tiny menu bar calendar.
#cask "sqlectron" # No inline edit

