# Deps for install
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"
  cask "font-source-code-pro-for-powerline"
brew "mas"

# General dev
brew "cmake"
brew "cocoapods" # For iOS dev
brew "libpng"
brew "ragel"
brew "git"
brew "asdf"
  # Deps for asdf nodejs
  # Read more to setup: https://github.com/asdf-vm/asdf-nodejs
  brew "coreutils"
  brew "gpg"

# Cli thing
brew "bash"
brew "bash-completion"
brew "bat" # Better cat
brew "coreutils"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "shellcheck"
brew "tree"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "httpie"
brew "tldr"
brew "jq"
brew "fd"
brew "fzf"
brew "the_silver_searcher" # ag, grep for code

# Directory to install
cask_args appdir: "/Applications"
# Cask / GUI
cask "docker"
cask "dozer" # Hide menu bar icons on macS
cask "google-cloud-sdk"
cask "spectacle"
cask "iterm2"
cask "alacritty"
cask "visual-studio-code"
cask "tableplus" # Tool for Relational Database
cask "brave-browser"
cask "iina" # The modern media player for macOS
cask "itsycal" # Itsycal is a tiny menu bar calendar.
cask "the-unarchiver"

# Mas
mas "Xcode", id: 497799835
